In [51]:
from sklearn.metrics import accuracy_score
from matplotlib import pyplot as plt
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
import pandas as pd
import numpy as np

#shows visualization in line -> replaces plt.show
%matplotlib inline

In [52]:
dt = pd.read_csv('https://tinyurl.com/yy63l66t')

print("Shape: ", dt.shape)
dt.head()

Shape:  (400, 5)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [53]:
Gender = pd.get_dummies(dt["Gender"], drop_first=True)
dt = pd.concat([dt, Gender],axis=1)
dt.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  Male
0  15624510    Male   19            19000          0     1
1  15810944    Male   35            20000          0     1
2  15668575  Female   26            43000          0     0
3  15603246  Female   27            57000          0     0
4  15804002    Male   19            76000          0     1

In [54]:
dt.drop(["Gender"],axis=1,inplace=True)
dt.isnull().sum()

User ID            0
Age                0
EstimatedSalary    0
Purchased          0
Male               0
dtype: int64

In [55]:
dt.head()

    User ID  Age  EstimatedSalary  Purchased  Male
0  15624510   19            19000          0     1
1  15810944   35            20000          0     1
2  15668575   26            43000          0     0
3  15603246   27            57000          0     0
4  15804002   19            76000          0     1

In [56]:
y = dt["Purchased"]
X = dt.iloc[:,[0,1,3]]

dt.head()
print("X: \n", X[0:5])
print("y: \n", y[0:5])

X:
     User ID  Age  Purchased
0  15624510   19          0
1  15810944   35          0
2  15668575   26          0
3  15603246   27          0
4  15804002   19          0
y:
 0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [57]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.3, random_state=0)

In [58]:
model = LogisticRegression().fit(X_train, y_train)

In [59]:
y_test_pred = model.predict(X_test)

print("y_test_pred: \n", y_test_pred[0:5])
print("\n")
print("y_test: \n", y_test[0:5])

y_test_pred:
 [0 0 0 0 0]


y_test:
 132    0
309    0
341    0
196    0
246    0
Name: Purchased, dtype: int64

In [62]:
acc = model.score(X_test, y_test)
print(f"Model accuracy1: \n {acc}")

print("\n")

acc1 = accuracy_score(y_test, y_test_pred)
print(f"Model accuracy1: \n {acc1}")

Model accuracy1:
 0.6583333333333333


Model accuracy1:
 0.6583333333333333